[
  {
    "group_id": 2,
    "group_name": "Омӯзиши веб-дизайн",
    "courses": [
      {
        "course_id": 6,
        "name": "Figma",
        "descriptions": "Дар ин курс шумо асосҳои кор бо Figma, яке аз беҳтарин воситаҳо барои дизайн ва прототипсозии вебсайтҳо ва мобилӣ, меомӯзед"
      },
      {
        "course_id": 7,
        "name": "UX",
        "descriptions": "Дар ин курс шумо меомӯзед, ки чӣ гуна таҷрибаи корбар (User Experience) тарроҳӣ мешавад, то вебсайтҳо ва барномаҳо барои истифодабарандагон қулай, фаҳмо ва ҷолиб бошанд."
      },
      {
        "course_id": 1733306441257,
        "name": "Моушун дизайн",
        "descriptions": "Ин курс барои онҳое тарҳрезӣ шудааст, ки мехоҳанд дар ҷаҳони эҷодкорӣ бо ёрии аниматсия, графикаи ҳаракаткунанда ва элементҳои динамикӣ малакаи худро такмил диҳанд."
      },
      {
        "course_id": 1733306533321,
        "name": "PhotoShop",
        "descriptions": "Ин курс барои онҳое таҳия шудааст, ки мехоҳанд тарроҳии сатҳи баландро омӯзанд, ки ҳам зебо бошад ва ҳам вазифаҳои тиҷоратиро самаранок иҷро кунад. "
      },
      {
        "course_id": 1733306670419,
        "name": "CorelDraw",
        "descriptions": "Ин курс барои онҳое таҳия шудааст, ки мехоҳанд истифодаи CorelDRAW, яке аз беҳтарин барномаҳо барои тарроҳии графикӣ, омӯзанд. Дарсҳо аз сатҳи ибтидоӣ оғоз мешаванд ва барои ба даст овардани малакаҳои касбӣ ."
      }
    ]
  },
  {
    "group_id": 3,
    "group_name": "Web-барномасозӣ",
    "courses": [
      {
        "course_id": 5,
        "name": "HTML",
        "descriptions": "Ин курс барои онҳое таҳия шудааст, ки мехоҳанд асосҳои HTML (HyperText Markup Language) – забони асосии сохтани вебсайтҳоро омӯзанд. Курс аз сатҳи ибтидоӣ оғоз мешавад ва иштирокчиён омӯхтани элементи асосии веб-дизайнро, аз ҷумла сохтани сафҳҳои статикӣ, шаклҳо ва линкҳоро, мегузаронанд."
      },
      {
        "course_id": 6,
        "name": "CSS",
        "descriptions": "Ин курс барои онҳое таҳия шудааст, ки мехоҳанд бо истифодаи CSS тарроҳии вебсайтҳоро эҷод кунанд ва малакаҳои худро дар таҳияи интерфейсҳои визуалӣ такмил диҳанд. Дарсҳо аз асоуси CSS оғоз мешаванд ва то техникаи пешрафта барои сохтани тарҳҳои зебо ва мукаммали вебсайт мерасанд."
      },
      {
        "course_id": 77,
        "name": "JavaScript",
        "descriptions": "Ин курс барои онҳое таҳия шудааст, ки мехоҳанд забони JavaScript-ро барои эҷоди веб-лоиҳаҳо ва нависишҳои динамикӣ аз сифр омӯзанд. Дарсҳо аз асосҳо оғоз мешаванд ва дар охир шумо метавонед вебсайтҳои муосир ва интерактивиро бо истифодаи JavaScript эҷод кунед."
      }
    ]
  }
]
